tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf26k80_tdd.h
#define RXB0CON_FILHIT1               3881
#define RXB0FILHIT1                   3882
#define JTOFF                         3883
#define RB0DBEN_FILHIT2               3884
#define RB0DBEN                       3885
#define RXB0FILHIT2                   3886
#define RXB0CON_FILHIT2               3887
#define RXB0CON_RXRTRRO               3888
#define RXB0FILHIT3                   3889
#define RXB0CON_RXRTRRO_FILHIT3       3890
#define RXB0CON_FILHIT3               3891
#define RXB0RTRR0                     3892
#define RXB0CON_FILHIT4               3893
#define RXB0FILHIT4                   3894
#define RXB0RTRRO                     3895
#define RXB0CON_RXM0_RTRRO            3896
#define RXB0M0                        3897
#define RXB0CON_RTRRO                 3898
#define RXB0CON_RXM0                  3899
#define RXB0M1                        3900
#define RXB0CON_RXM1                  3901
#define RXB0FUL                       3902
#define RXB0CON_RXFUL                 3903
#define RXB0SIDH                      3904
#define RXB0SIDH_SID                  3905
#define RXB0SIDH_SID3                 3906
#define RXB0SID3                      3907
#define RXB0SIDH_SID4                 3908
#define RXB0SID4                      3909
#define RXB0SIDH_SID5                 3910
#define RXB0SID5                      3911
#define RXB0SIDH_SID6                 3912
#define RXB0SID6                      3913
#define RXB0SIDH_SID7                 3914
#define RXB0SID7                      3915
#define RXB0SIDH_SID8                 3916
#define RXB0SID8                      3917
#define RXB0SIDH_SID9                 3918
#define RXB0SID9                      3919
#define RXB0SIDH_SID10                3920
#define RXB0SID10                     3921
#define RXB0SIDL                      3922
#define RXB0SIDL_EID                  3923
#define RXB0SIDL_EID16                3924
#define RXB0EID16                     3925
#define RXB0SIDL_EID17                3926
#define RXB0EID17                     3927
#define RXB0EXID                      3928
#define RXB0SIDL_EXID                 3929
#define RXB0SIDL_SRR                  3930
#define RXB0SRR                       3931
#define RXB0SID0                      3932
#define RXB0SIDL_SID0                 3933
#define RXB0SIDL_SID                  3934
#define RXB0SIDL_SID1                 3935
#define RXB0SID1                      3936
#define RXB0SIDL_SID2                 3937
#define RXB0SID2                      3938
#define RXB0EIDH                      3939
#define RXB0EID8                      3940
#define RXB0EIDH_EID                  3941
#define RXB0EIDH_EID8                 3942
#define RXB0EID9                      3943
#define RXB0EIDH_EID9                 3944
#define RXB0EID10                     3945
#define RXB0EIDH_EID10                3946
#define RXB0EID11                     3947
#define RXB0EIDH_EID11                3948
#define RXB0EID12                     3949
#define RXB0EIDH_EID12                3950
#define RXB0EID13                     3951
#define RXB0EIDH_EID13                3952
#define RXB0EID14                     3953
#define RXB0EIDH_EID14                3954
#define RXB0EID15                     3955
#define RXB0EIDH_EID15                3956
#define RXB0EIDL                      3957
#define RXB0EID0                      3958
#define RXB0EIDL_EID                  3959
#define RXB0EIDL_EID0                 3960
#define RXB0EID1                      3961
#define RXB0EIDL_EID1                 3962
#define RXB0EID2                      3963
#define RXB0EIDL_EID2                 3964
#define RXB0EID3                      3965
#define RXB0EIDL_EID3                 3966
#define RXB0EID4                      3967
#define RXB0EIDL_EID4                 3968
#define RXB0EID5                      3969
#define RXB0EIDL_EID5                 3970
#define RXB0EID6                      3971
#define RXB0EIDL_EID6                 3972
#define RXB0EID7                      3973
#define RXB0EIDL_EID7                 3974
#define RXB0DLC                       3975
#define RXB0DLC_DLC0                  3976
#define RXB0DLC_DLC                   3977
#define RXB0DLC0                      3978
#define RXB0DLC1                      3979
#define RXB0DLC_DLC1                  3980
#define RXB0DLC2                      3981
#define RXB0DLC_DLC2                  3982
#define RXB0DLC3                      3983
#define RXB0DLC_DLC3                  3984
#define RXB0DLC_RB                    3985
#define RXB0RB0                       3986
#define RXB0DLC_RB0                   3987
#define RXB0RB1                       3988
#define RXB0DLC_RB1                   3989
#define RXB0DLC_RXRTR                 3990
#define RXB0RTR                       3991
#define RXB0D0                        3992
#define RXB0D00                       3993
#define RXB0D01                       3994
#define RXB0D02                       3995
#define RXB0D03                       3996
#define RXB0D04                       3997
#define RXB0D05                       3998
#define RXB0D06                       3999
#define RXB0D07                       4000
#define RXB0D1                        4001
#define RXB0D10                       4002
#define RXB0D11                       4003
#define RXB0D12                       4004
#define RXB0D13                       4005
#define RXB0D14                       4006
#define RXB0D15                       4007
#define RXB0D16                       4008
#define RXB0D17                       4009
#define RXB0D2                        4010
#define RXB0D20                       4011
#define RXB0D21                       4012
#define RXB0D22                       4013
#define RXB0D23                       4014
#define RXB0D24                       4015
#define RXB0D25                       4016
#define RXB0D26                       4017
#define RXB0D27                       4018
#define RXB0D3                        4019
#define RXB0D30                       4020
#define RXB0D31                       4021
#define RXB0D32                       4022
#define RXB0D33                       4023
#define RXB0D34                       4024
#define RXB0D35                       4025
#define RXB0D36                       4026
#define RXB0D37                       4027
#define RXB0D4                        4028
#define RXB0D40                       4029
#define RXB0D41                       4030
#define RXB0D42                       4031
#define RXB0D43                       4032
#define RXB0D44                       4033
#define RXB0D45                       4034
#define RXB0D46                       4035
#define RXB0D47                       4036
#define RXB0D5                        4037
#define RXB0D50                       4038
#define RXB0D51                       4039
#define RXB0D52                       4040
#define RXB0D53                       4041
#define RXB0D54                       4042
#define RXB0D55                       4043
#define RXB0D56                       4044
#define RXB0D57                       4045
#define RXB0D6                        4046
#define RXB0D60                       4047
#define RXB0D61                       4048
#define RXB0D62                       4049
#define RXB0D63                       4050
#define RXB0D64                       4051
#define RXB0D65                       4052
#define RXB0D66                       4053
#define RXB0D67                       4054
#define RXB0D7                        4055
#define RXB0D70                       4056
#define RXB0D71                       4057
#define RXB0D72                       4058
#define RXB0D73                       4059
#define RXB0D74                       4060
#define RXB0D75                       4061
#define RXB0D76                       4062
#define RXB0D77                       4063
#define CANSTAT                       4064
#define CANSTAT_EICODE0               4065
#define CANSTAT_EICODE1               4066
#define CANSTAT_ICODE0                4067
#define CANSTAT_EICODE1_ICODE0        4068
#define CANSTAT_EICODE2               4069
#define CANSTAT_ICODE1                4070
#define CANSTAT_EICODE2_ICODE1        4071
#define CANSTAT_EICODE3               4072
#define CANSTAT_ICODE2                4073
#define CANSTAT_EICODE3_ICODE2        4074
#define CANSTAT_EICODE4               4075
#define CANSTAT_OPMODE0               4076
#define CANSTAT_OPMODE                4077
#define CANSTAT_OPMODE1               4078
#define CANSTAT_OPMODE2               4079
#define CANCON                        4080
#define CANCON_FP0                    4081
#define CANCON_FP1                    4082
#define CANCON_WIN0                   4083
#define CANCON_WIN0_FP1               4084
#define CANCON_FP2                    4085
#define CANCON_WIN1                   4086
#define CANCON_WIN1_FP2               4087
#define CANCON_FP3                    4088
#define CANCON_WIN2                   4089
#define CANCON_WIN2_FP3               4090
#define CANCON_ABAT                   4091
#define CANCON_REQOP                  4092
#define CIOCON                        4093
#define CLKSEL                        4094
#define CANCAP                        4095
#define ENDRHI                        4096
#define TX2EN                         4097
#define TX2SRC                        4098
#define COMSTAT                       4099
#define EWARN                         4100
#define RXWARN                        4101
#define TXWARN                        4102
#define RXBP                          4103
#define TXBP                          4104
#define TXBO                          4105
#define RXB1OVFL                      4106
#define RXBNOVFL                      4107
#define FIFOEMPTY                     4108
#define RXB0OVFL                      4109
#define NOT_FIFOEMPTY                 4110
#define nFIFOEMPTY                    4111
#define ECANCON                       4112
#define EWIN                          4113
#define EWIN0                         4114
#define EWIN1                         4115
#define EWIN2                         4116
#define EWIN3                         4117
#define EWIN4                         4118
#define FIFOWM                        4119
#define MDSEL0                        4120
#define MDSEL                         4121
#define MDSEL1                        4122
#define EEDATA                        4123
#define EEADR                         4124
#define EEADRH                        4125
#define PIE5                          4126
#define FIFOWMIE                      4127
#define PIE5_RXB0IE                   4128
#define RXBnIE                        4129
#define PIE5_RXB1IE                   4130
#define PIE5_TXB0IE                   4131
#define PIE5_TXB1IE                   4132
#define PIE5_TXB2IE                   4133
#define TXBnIE                        4134
#define ERRIE                         4135
#define WAKIE                         4136
#define IRXIE                         4137
#define PIR5                          4138
#define FIFOWMIF                      4139
#define RXB0IF                        4140
#define RXBnIF                        4141
#define RXB1IF                        4142
#define TXB0IF                        4143
#define TXB1IF                        4144
#define TXB2IF                        4145
#define TXBnIF                        4146
#define ERRIF                         4147
#define WAKIF                         4148
#define IRXIF                         4149
#define IPR5                          4150
#define RXB0IP                        4151
#define CCH05                         4152
#define FIFOWMIP                      4153
#define RXB1IP                        4154
#define CCH15                         4155
#define RXBnIP                        4156
#define TXB0IP                        4157
#define EVPOL05                       4158
#define TXB1IP                        4159
#define EVPOL15                       4160
#define TXBnIP                        4161
#define TXB2IP                        4162
#define ERRIP                         4163
#define WAKIP                         4164
#define IRXIP                         4165
#define TXREG2                        4166
#define RCREG2                        4167
#define SPBRG2                        4168
#define SPBRGH2                       4169
#define SPBRGH1                       4170
#define EECON2                        4171
#define EECON1                        4172
#define RD                            4173
#define WR                            4174
#define WREN                          4175
#define WRERR                         4176
#define FREE                          4177
#define CFGS                          4178
#define EEFS                          4179
#define EEPGD                         4180
#define PORTA                         4181
#define ULPWUIN                       4182
#define RA0                           4183
#define RA1                           4184
#define RA2                           4185
#define RA3                           4186
#define LVDIN                         4187
#define RA5                           4188
#define RA6                           4189
#define RA7                           4190
#define RJPU                          4191
#define PORTB                         4192
#define PORTB_RB0                     4193
#define PORTB_RB1                     4194
#define RB2                           4195
#define CCP2_PA2                      4196
#define RB3                           4197
#define RB4                           4198
#define RB5                           4199
#define RB6                           4200
#define RB7                           4201
#define PORTC                         4202
#define RC0                           4203
#define PA2                           4204
#define RC1                           4205
#define CCP2                          4206
#define PA1                           4207
#define RC2                           4208
#define RC3                           4209
#define RC4                           4210
#define RC5                           4211
#define RC6                           4212
#define RC7                           4213
#define PORTE                         4214
#define RE3                           4215
#define PC3E                          4216
#define CCP9E                         4217
#define TMR4                          4218
#define T4CON                         4219
#define T4CKPS0                       4220
#define T4CKPS                        4221
#define T4CKPS1                       4222
#define TMR4ON                        4223
#define T4OUTPS                       4224
#define T4OUTPS0                      4225
#define T4OUTPS1                      4226
#define T4OUTPS2                      4227
#define T4OUTPS3                      4228
#define LATA                          4229
#define LATA0                         4230
#define LA0                           4231
#define LATA1                         4232
#define LA1                           4233
#define LATA2                         4234
#define LA2                           4235
#define LATA3                         4236
#define LA3                           4237
#define LATA5                         4238
#define LA5                           4239
#define LATA6                         4240
#define LA6                           4241
#define LATA7                         4242
#define LA7                           4243
#define LATB                          4244
#define LB0                           4245
#define LATB0                         4246
#define LB1                           4247
#define LATB1                         4248
#define LB2                           4249
#define LATB2                         4250
#define LB3                           4251
#define LATB3                         4252
#define LB4                           4253
#define LATB4                         4254
#define LB5                           4255
#define LATB5                         4256
#define LB6                           4257
#define LATB6                         4258
#define LB7                           4259
#define LATB7                         4260
#define LATC                          4261
#define LATC0                         4262
#define LC0                           4263
#define LATC1                         4264
#define LC1                           4265
#define LATC2                         4266
#define LC2                           4267
#define LATC3                         4268
#define LC3                           4269
#define LATC4                         4270
#define LC4                           4271
#define LATC5                         4272
#define LC5                           4273
#define LATC6                         4274
#define LC6                           4275
#define LATC7                         4276
#define LC7                           4277
#define SLRCON                        4278
#define SLRA                          4279
#define SLRB                          4280
#define SLRC                          4281
#define ODCON                         4282
#define U1OD                          4283
#define U2OD                          4284
#define CCP1OD                        4285
#define CCP2OD                        4286
#define CCP3OD                        4287
#define CCP4OD                        4288
#define CCP5OD                        4289
#define SSPOD                         4290
#define TRISA                         4291
#define TRISA0                        4292
#define TRISA1                        4293
#define TRISA2                        4294
#define TRISA3                        4295
#define TRISA5                        4296
#define TRISA6                        4297
#define TRISA7                        4298
#define TRISB                         4299
#define TRISB0                        4300
#define TRISB1                        4301
#define TRISB2                        4302
#define TRISB3                        4303
#define TRISB4                        4304
#define TRISB5                        4305
#define TRISB6                        4306
#define TRISB7                        4307
#define TRISC                         4308
#define TRISC0                        4309
#define TRISC1                        4310
#define TRISC2                        4311
#define TRISC3                        4312
#define TRISC4                        4313
#define TRISC5                        4314
#define TRISC6                        4315
#define TRISC7                        4316
#define CCPTMRS                       4317
#define C1TSEL                        4318
#define C2TSEL                        4319
#define C3TSEL                        4320
#define C4TSEL                        4321
#define C5TSEL                        4322
#define REFOCON                       4323
#define RODIV0                        4324
#define RODIV                         4325
#define RODIV1                        4326
#define RODIV2                        4327
#define RODIV3                        4328
#define ROSEL                         4329
#define ROSSLP                        4330
#define ROON                          4331
#define OSCTUNE                       4332
#define TUN0                          4333
#define TUN                           4334
#define TUN1                          4335
#define TUN2                          4336
#define TUN3                          4337
#define TUN4                          4338
#define TUN5                          4339
#define PLLEN                         4340
#define INTSRC                        4341
#define PSTR1CON                      4342
#define STRA                          4343
#define STRB                          4344
#define STRC                          4345
#define STRD                          4346
#define STRSYNC                       4347
#define CMPL                          4348
#define CMPL0                         4349
#define CMPL1                         4350
#define PIE1                          4351
#define TMR1IE                        4352
#define TMR2IE                        4353
#define TMR1GIE                       4354
#define SSPIE                         4355
#define PIE1_TX1IE                    4356
#define TXIE                          4357
#define RCIE                          4358
#define RC1IE                         4359
#define ADIE                          4360
#define PIR1                          4361
#define TMR1IF                        4362
#define TMR2IF                        4363
#define TMR1GIF                       4364
#define SSPIF                         4365
#define PIR1_TX1IF                    4366
#define TXIF                          4367
#define RCIF                          4368
#define RC1IF                         4369
#define ADIF                          4370
#define IPR1                          4371
#define TMR1IP                        4372
#define TMR2IP                        4373
#define TMR1GIP                       4374
#define SSPIP                         4375
#define TX1IP                         4376
#define TXIP                          4377
#define RCIP                          4378
#define RC1IP                         4379
#define ADIP                          4380
#define PIE2                          4381
#define TMR3GIE                       4382
#define TMR3IE                        4383
#define HLVDIE                        4384
#define LVDIE                         4385
#define BCLIE                         4386
#define OSCFIE                        4387
#define PIR2                          4388
#define TMR3GIF                       4389
#define TMR3IF                        4390
#define HLVDIF                        4391
#define LVDIF                         4392
#define BCLIF                         4393
#define OSCFIF                        4394
#define IPR2                          4395
#define TMR3GIP                       4396
#define TMR3IP                        4397
#define HLVDIP                        4398
#define LVDIP                         4399
#define BCLIP                         4400
#define OSCFIP                        4401
#define PIE3                          4402
#define RXBNIE                        4403
#define PIE3_RXB1IE                   4404
#define CCP1IE                        4405
#define CCP2IE                        4406
#define PIE3_TXB0IE                   4407
#define CTMUIE                        4408
#define PIE3_TXB1IE                   4409
#define TXBNIE                        4410
#define PIE3_TXB2IE                   4411
#define PIE3_TX2IE                    4412
#define RC2IE                         4413
#define PIR3                          4414
#define RXBNIF                        4415
#define CCP1IF                        4416
#define CCP2IF                        4417
#define CTMUIF                        4418
#define TXBNIF                        4419
#define PIR3_TX2IF                    4420
#define RC2IF                         4421
#define IPR3                          4422
#define CCP1IP                        4423
#define RXBNIP                        4424
#define CCP2IP                        4425
#define CTMUIP                        4426
#define TX2IP                         4427
#define TXBNIP                        4428
#define RC2IP                         4429
#define RCSTA2                        4430
#define RCD82                         4431
#define RX9D2                         4432
#define RCSTA2_RX9D                   4433
#define OERR2                         4434
#define RCSTA2_OERR                   4435
#define FERR2                         4436
#define RCSTA2_FERR                   4437
#define ADDEN2                        4438
